Repository: OSGeo-fr/communication
Catalog: galette/plugins/galette-plugin-admintools/lang/*.utf8.po
Languages: fr_fr

source: An error occured reinitializing fields configuration :(
fr_fr: Une erreur est survenue lors de la réinitialisation de la configuration des champs :(

source: You should use that function if you can see strange characters in your datas; after a manual import, or if you've not used Galette's update scripts.
fr_fr: Vous devriez utiliser cette fonctions si d'étranges caractères aparaissent dans vos données ; après un import manuel, ou si vous n'avez pas utilisé les scripts de mise à jour de Galette.

source: Fields configuration has been successfully reinitialized.
fr_fr: La configuration des champs a été réinitialisée avec succès.

source: Database should have been successfully converted to UTF-8!
fr_fr: La base de données devrait avoir été convertie en UTF-8&nbsp;!

source: Make sure you've done a backup of the database before using any of the following tools!
fr_fr: Assurez-vous de faire une sauvegarde de votre base de données avant d'utiliser l'un des outils suivants&nbsp;!

source: Various administrative tools
fr_fr: Divers outils administratifs

source: Check PHP modules
fr_fr: Vérification des modules PHP

source: Modules report
fr_fr: Rapport sur les modules

source: Reinitialize emails contents
fr_fr: Réinitialiser les contenus des emails

source: Content tools
fr_fr: Outils de contenus

source: An error occured reinitializing texts :(
fr_fr: Une erreur est survenue lors de la réinitialisation des textes :(

source: Converts the whole database data to UTF-8, do not change anything on the tables, just proceed data conversion.
fr_fr: Converti l'ensemble des données de la base en UTF-8, ne change rien sur les tables, effectue juste la conversion.

source: Database tools
fr_fr: Outils de base de données

source: Logins and passwords has been successfully filled (%i processed).
fr_fr: Les login et mot de passe ont été correctement remplis (%i traités).

source: That function is available for MySQL installations only!
fr_fr: Cette fonction n'est disponible que pour les installations sous MySQL&nbsp;!

source: Convert encoding
fr_fr: Conversion de l'encodage

source: Some PHP modules are missing. Please install them or contact your support.<br/>More informations on required modules may be found in the documentation.
fr_fr: Certains modules PHP sont manquants. Veuillez les installer ou contacter votre support. <br/>Plus d'informations sur les modules requis sont disponibles dans la documentation.

source: Generate values for empty logins and passwords
fr_fr: Génère des valeurs pour les login et mot de passe vides

source: An error occured reinitializing PDF models :(
fr_fr: Une erreur est survenue lors de la réinitialisation des modèles PDF :(

source: Admin tools
fr_fr: Outils admin

source: An error occured filling empty logins and passwords :(
fr_fr: Une erreur est survenue lors de la création de valeurs pour les identifiants vides :(

source: Administration tools
fr_fr: Outils d'administration

source: Reinitialize PDF models
fr_fr: Réinitialiser les contenus des modèles PDF

source: Admin Tools
fr_fr: Outils Admin

source: That conversion stuff will read your entire database, and write back each non UTF-8 values after conversion; this may take a while.
fr_fr: Cette conversion va lire l'intégralité de votre base de données, et ré-écrire chaque valeur non UTF-8 après conversion. Cela peut prendre un certain temps.

source: Texts has been successfully reinitialized.
fr_fr: Les textes ont été réinitialisés avec succès.

source: Reinitialize fields configuration
fr_fr: Réinitialiser la configuration des champs

source: PDF models has been successfully reinitialized.
fr_fr: Les modèles PDF ont été réinitialisés avec succès.
